xbenkozx/RAZ-RE/Firmware/keil-mdk/firmware/CMSIS/device/system_n32g031.c
/*****************************************************************************
 * Copyright (c) 2019, Nations Technologies Inc.
 *
 * All rights reserved.
 * ****************************************************************************
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * - Redistributions of source code must retain the above copyright notice,
 * this list of conditions and the disclaimer below.
 *
 * Nations' name may not be used to endorse or promote products derived from
 * this software without specific prior written permission.
 *
 * DISCLAIMER: THIS SOFTWARE IS PROVIDED BY NATIONS "AS IS" AND ANY EXPRESS OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * DISCLAIMED. IN NO EVENT SHALL NATIONS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
 * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * ****************************************************************************/

/**
 * @file system_n32g031.c
 * @author Nations
 * @version v1.0.2
 *
 * @copyright Copyright (c) 2019, Nations Technologies Inc. All rights reserved.
 */
#include "n32g031.h"

/* Uncomment the line corresponding to the desired System clock (SYSCLK)
   frequency (after reset the HSI is used as SYSCLK source)

   IMPORTANT NOTE:
   ==============
   1. After each device reset the HSI is used as System clock source.

   2. Please make sure that the selected System clock doesn't exceed your
   device's maximum frequency.

   3. If none of the define below is enabled, the HSI is used as System clock
    source.

   4. The System clock configuration functions provided within this file assume
   that:
        - For Low and High density Value line devices an external 8MHz
          crystal is used to drive the System clock.
        - For Low and High density devices an external 8MHz crystal is
          used to drive the System clock.
        - For Connectivity line devices an external 25MHz crystal is used to
   drive the System clock. If you are using different crystal you have to adapt
   those functions accordingly.
    */

#define SYSCLK_USE_HSI     0
#define SYSCLK_USE_HSE     1
#define SYSCLK_USE_HSI_PLL 2
#define SYSCLK_USE_HSE_PLL 3
#define SYSCLK_USE_LSE     4
#define SYSCLK_USE_LSI     5

#ifndef SYSCLK_FREQ
#define SYSCLK_FREQ 48000000
#endif

/*
* SYSCLK_SRC *
** SYSCLK_USE_HSI     **
** SYSCLK_USE_HSE     **
** SYSCLK_USE_HSI_PLL **
** SYSCLK_USE_HSE_PLL **
** SYSCLK_USE_LSE     **
** SYSCLK_USE_LSI     **
*/
#ifndef SYSCLK_SRC
#define SYSCLK_SRC SYSCLK_USE_HSI_PLL
#endif

#if SYSCLK_SRC == SYSCLK_USE_HSI

    #ifndef HSI_VALUE
        #error HSI_VALUE must be defined!
    #endif

    #if SYSCLK_FREQ != HSI_VALUE
        #error SYSCL_FREQ must be set to HSI_VALUE
    #endif

#elif SYSCLK_SRC == SYSCLK_USE_HSE

    #ifndef HSE_VALUE
        #error HSE_VALUE must be defined!
    #endif

    #if SYSCLK_FREQ != HSE_VALUE
        #error SYSCL_FREQ must be set to HSE_VALUE
    #endif

#elif SYSCLK_SRC == SYSCLK_USE_HSI_PLL || SYSCLK_SRC == SYSCLK_USE_HSE_PLL
	
		#if SYSCLK_SRC == SYSCLK_USE_HSI_PLL
				#ifndef HSI_VALUE
						#error HSI_VALUE must be defined!
				#endif
				#define PLLSRC_VALUE  HSI_VALUE
		#elif SYSCLK_SRC == SYSCLK_USE_HSE_PLL
				#ifndef HSE_VALUE
				    #error HSE_VALUE must be defined!
				#endif
				#define PLLSRC_VALUE  HSE_VALUE
		#endif 
		
    #if ((SYSCLK_FREQ * 1) >= 48000000) && ((SYSCLK_FREQ * 1) <= 72000000)
        #if ( ((PLLSRC_VALUE / 1) >= 4000000) && ((PLLSRC_VALUE / 1) <= 20000000) && ((PLLSRC_VALUE % 1) == 0) )\
            && ( (((SYSCLK_FREQ * 1) / PLLSRC_VALUE) >= 3) && (((SYSCLK_FREQ * 1) / PLLSRC_VALUE) <= 18) && (((SYSCLK_FREQ * 1) % PLLSRC_VALUE) == 0) )
                #define PLL_MUL    (SYSCLK_FREQ * 1 / PLLSRC_VALUE)
                #define PLL_PRE    0
								#define PLLOUT_DIV 0
                #define SYSCLK_CONFIG_PASS
				#elif ( ((PLLSRC_VALUE / 2) >= 4000000) && ((PLLSRC_VALUE / 2) <= 20000000) && ((PLLSRC_VALUE % 2) == 0) )\
						&& ( (((SYSCLK_FREQ * 2) / PLLSRC_VALUE) >= 3) && (((SYSCLK_FREQ * 2) / PLLSRC_VALUE) <= 18) && (((SYSCLK_FREQ * 2) % PLLSRC_VALUE) == 0) )
								#define PLL_MUL    (SYSCLK_FREQ * 2 / PLLSRC_VALUE)
								#define PLL_PRE    1
								#define PLLOUT_DIV 0
								#define SYSCLK_CONFIG_PASS
				#elif ( ((PLLSRC_VALUE / 3) >= 4000000) && ((PLLSRC_VALUE / 3) <= 20000000) && ((PLLSRC_VALUE % 3) == 0) )\
						&& ( (((SYSCLK_FREQ * 3) / PLLSRC_VALUE) >= 3) && (((SYSCLK_FREQ * 3) / PLLSRC_VALUE) <= 18) && (((SYSCLK_FREQ * 3) % PLLSRC_VALUE) == 0) )
								#define PLL_MUL    (SYSCLK_FREQ * 3 / PLLSRC_VALUE)
								#define PLL_PRE    2
								#define PLLOUT_DIV 0
								#define SYSCLK_CONFIG_PASS
				#elif ( ((PLLSRC_VALUE / 4) >= 4000000) && ((PLLSRC_VALUE / 4) <= 20000000) && ((PLLSRC_VALUE % 4) == 0) )\
						&& ( (((SYSCLK_FREQ * 4) / PLLSRC_VALUE) >= 3) && (((SYSCLK_FREQ * 4) / PLLSRC_VALUE) <= 18) && (((SYSCLK_FREQ * 4) % PLLSRC_VALUE) == 0) )
								#define PLL_MUL    (SYSCLK_FREQ * 4 / PLLSRC_VALUE)
								#define PLL_PRE    3
								#define PLLOUT_DIV 0
								#define SYSCLK_CONFIG_PASS
        #endif
    #endif
    
    #ifndef SYSCLK_CONFIG_PASS
        #if ((SYSCLK_FREQ * 2) >= 48000000) && ((SYSCLK_FREQ * 2) <= 72000000)          
            #if ( ((PLLSRC_VALUE / 1) >= 4000000) && ((PLLSRC_VALUE / 1) <= 20000000) && ((PLLSRC_VALUE % 1) == 0) )\
                && ( (((SYSCLK_FREQ * 2) / PLLSRC_VALUE) >= 3) && (((SYSCLK_FREQ * 2) / PLLSRC_VALUE) <= 18) && (((SYSCLK_FREQ * 2) % PLLSRC_VALUE) == 0) )
                    #define PLL_MUL    (SYSCLK_FREQ * 2 / PLLSRC_VALUE)
                    #define PLL_PRE    0
										#define PLLOUT_DIV 1
                    #define SYSCLK_CONFIG_PASS
						#elif ( ((PLLSRC_VALUE / 2) >= 4000000) && ((PLLSRC_VALUE / 2) <= 20000000) && ((PLLSRC_VALUE % 2) == 0) )\
								&& ( (((SYSCLK_FREQ * 4) / PLLSRC_VALUE) >= 3) && (((SYSCLK_FREQ * 4) / PLLSRC_VALUE) <= 18) && (((SYSCLK_FREQ * 4) % PLLSRC_VALUE) == 0) )
										#define PLL_MUL    (SYSCLK_FREQ * 4 / PLLSRC_VALUE)
										#define PLL_PRE    1
										#define PLLOUT_DIV 1
										#define SYSCLK_CONFIG_PASS
						#elif ( ((PLLSRC_VALUE / 3) >= 4000000) && ((PLLSRC_VALUE / 3) <= 20000000) && ((PLLSRC_VALUE % 3) == 0) )\
								&& ( (((SYSCLK_FREQ * 6) / PLLSRC_VALUE) >= 3) && (((SYSCLK_FREQ * 6) / PLLSRC_VALUE) <= 18) && (((SYSCLK_FREQ * 6) % PLLSRC_VALUE) == 0) )
										#define PLL_MUL    (SYSCLK_FREQ * 6 / PLLSRC_VALUE)
										#define PLL_PRE    2
										#define PLLOUT_DIV 1
										#define SYSCLK_CONFIG_PASS
						#elif ( ((PLLSRC_VALUE / 4) >= 4000000) && ((PLLSRC_VALUE / 4) <= 20000000) && ((PLLSRC_VALUE % 4) == 0) )\
								&& ( (((SYSCLK_FREQ * 8) / PLLSRC_VALUE) >= 3) && (((SYSCLK_FREQ * 8) / PLLSRC_VALUE) <= 18) && (((SYSCLK_FREQ * 8) % PLLSRC_VALUE) == 0) )
										#define PLL_MUL    (SYSCLK_FREQ * 8 / PLLSRC_VALUE)
										#define PLL_PRE    3
										#define PLLOUT_DIV 1
										#define SYSCLK_CONFIG_PASS                          
             #endif
         #endif
     #endif
    
    #ifndef SYSCLK_CONFIG_PASS
        #if ((SYSCLK_FREQ * 3) >= 48000000) && ((SYSCLK_FREQ * 3) <= 72000000)           
            #if ( ((PLLSRC_VALUE / 1) >= 4000000) && ((PLLSRC_VALUE / 1) <= 20000000) && ((PLLSRC_VALUE % 1) == 0) )\
                && ( (((SYSCLK_FREQ * 3) / PLLSRC_VALUE) >= 3) && (((SYSCLK_FREQ * 3) / PLLSRC_VALUE) <= 18) && (((SYSCLK_FREQ * 3) % PLLSRC_VALUE) == 0) )
                    #define PLL_MUL    (SYSCLK_FREQ * 3 / PLLSRC_VALUE)
                    #define PLL_PRE    0
										#define PLLOUT_DIV 2
                    #define SYSCLK_CONFIG_PASS
						#elif ( ((PLLSRC_VALUE / 2) >= 4000000) && ((PLLSRC_VALUE / 2) <= 20000000) && ((PLLSRC_VALUE % 2) == 0) )\
								&& ( (((SYSCLK_FREQ * 6) / PLLSRC_VALUE) >= 3) && (((SYSCLK_FREQ * 6) / PLLSRC_VALUE) <= 18) && (((SYSCLK_FREQ * 6) % PLLSRC_VALUE) == 0) )
										#define PLL_MUL    (SYSCLK_FREQ * 6 / PLLSRC_VALUE)
										#define PLL_PRE    1
										#define PLLOUT_DIV 2
										#define SYSCLK_CONFIG_PASS
						#elif ( ((PLLSRC_VALUE / 3) >= 4000000) && ((PLLSRC_VALUE / 3) <= 20000000) && ((PLLSRC_VALUE % 3) == 0) )\
								&& ( (((SYSCLK_FREQ * 9) / PLLSRC_VALUE) >= 3) && (((SYSCLK_FREQ * 9) / PLLSRC_VALUE) <= 18) && (((SYSCLK_FREQ * 9) % PLLSRC_VALUE) == 0) )
										#define PLL_MUL    (SYSCLK_FREQ * 9 / PLLSRC_VALUE)
										#define PLL_PRE    2
										#define PLLOUT_DIV 2
										#define SYSCLK_CONFIG_PASS
						#elif ( ((PLLSRC_VALUE / 4) >= 4000000) && ((PLLSRC_VALUE / 4) <= 20000000) && ((PLLSRC_VALUE % 4) == 0) )\
								&& ( (((SYSCLK_FREQ * 12) / PLLSRC_VALUE) >= 3) && (((SYSCLK_FREQ * 12) / PLLSRC_VALUE) <= 18) && (((SYSCLK_FREQ * 12) % PLLSRC_VALUE) == 0) )
										#define PLL_MUL    (SYSCLK_FREQ * 12 / PLLSRC_VALUE)
										#define PLL_PRE    3
										#define PLLOUT_DIV 2
										#define SYSCLK_CONFIG_PASS                   
            #endif
         #endif
     #endif
    
   #ifndef SYSCLK_CONFIG_PASS
       #if ((SYSCLK_FREQ * 4) >= 48000000) && ((SYSCLK_FREQ * 4) <= 72000000)            
           #if  (((PLLSRC_VALUE / 1) >= 4000000) && ((PLLSRC_VALUE / 1) <= 20000000) && ((PLLSRC_VALUE % 1) == 0) \
					 && (((SYSCLK_FREQ * 4) / PLLSRC_VALUE) >= 3) && (((SYSCLK_FREQ * 4) / PLLSRC_VALUE) <= 18) && (((SYSCLK_FREQ * 4) % PLLSRC_VALUE) == 0) )
                    #define PLL_MUL    (SYSCLK_FREQ * 4 / PLLSRC_VALUE)
                    #define PLL_PRE    0
										#define PLLOUT_DIV 3
                    #define SYSCLK_CONFIG_PASS
           #elif (((PLLSRC_VALUE / 2) >= 4000000) && ((PLLSRC_VALUE / 2) <= 20000000) && ((PLLSRC_VALUE % 2) == 0)  \
					 && (((SYSCLK_FREQ * 8) / PLLSRC_VALUE) >= 3) && (((SYSCLK_FREQ * 8) / PLLSRC_VALUE) <= 18) && (((SYSCLK_FREQ * 8) % PLLSRC_VALUE) == 0) )
										#define PLL_MUL    (SYSCLK_FREQ * 8 / PLLSRC_VALUE)
										#define PLL_PRE    1
										#define PLLOUT_DIV 3
										#define SYSCLK_CONFIG_PASS
           #elif  (((PLLSRC_VALUE / 3) >= 4000000) && ((PLLSRC_VALUE / 3) <= 20000000) && ((PLLSRC_VALUE % 3) == 0) \
					 && (((SYSCLK_FREQ * 12) / PLLSRC_VALUE) >= 3) && (((SYSCLK_FREQ * 12) / PLLSRC_VALUE) <= 18) && (((SYSCLK_FREQ * 12) % PLLSRC_VALUE) == 0) )
										#define PLL_MUL    (SYSCLK_FREQ * 12 / PLLSRC_VALUE)
										#define PLL_PRE    2
										#define PLLOUT_DIV 3
										#define SYSCLK_CONFIG_PASS
           #elif  (((PLLSRC_VALUE / 4) >= 4000000) && ((PLLSRC_VALUE / 4) <= 20000000) && ((PLLSRC_VALUE % 4) == 0) \
					 && (((SYSCLK_FREQ * 16) / PLLSRC_VALUE) >= 3) && (((SYSCLK_FREQ * 16) / PLLSRC_VALUE) <= 18) && (((SYSCLK_FREQ * 16) % PLLSRC_VALUE) == 0) )
										#define PLL_MUL    (SYSCLK_FREQ * 16 / PLLSRC_VALUE)
										#define PLL_PRE    3
										#define PLLOUT_DIV 3
										#define SYSCLK_CONFIG_PASS                          
           #endif
       #endif
   #endif
     
	 #ifndef SYSCLK_CONFIG_PASS
			 #error Cannot make a PLL multiply factor to SYSCLK_FREQ.
	 #endif
		 
